Repository: patricktran2911/iUSC
Catalog: ESDataLayer/LocalizationHelper/Resources/DataModelLocalizable.xcstrings
Source language: en
Languages: vi

source: "We elect a U.S. Senator for how many years?"
vi: "Chúng ta bầu một Thượng nghị sĩ Hoa Kỳ cho nhiệm kỳ bao nhiêu năm?"

source: We the People
vi: Chúng tôi là người

source: "What are the two major political parties in the United States?"
vi: "Hai đảng chính của Hoa Kỳ là gì?"

source: "What are the two parts of the U.S. Congress?"
vi: "Hai phần của Quốc hội Hoa Kỳ là gì?"

source: "What are two Cabinet-level positions?"
vi: "Kể tên hai vị trí cấp Bộ trong Nội các."

source: "What are two rights in the Declaration of Independence?"
vi: "Trong Tuyên ngôn Độc lập có hai quyền nào?"

source: "What are two rights of everyone living in the United States?"
vi: "Hai quyền của mọi người sống ở Hoa Kỳ là gì?"

source: "What are two ways that Americans can participate in their democracy?"
vi: "Hai cách người Mỹ có thể tham gia nền dân chủ là gì?"

source: "What did Martin Luther King, Jr. do?"
vi: "Martin Luther King, Jr. đã làm gì?"

source: "What did Susan B. Anthony do?"
vi: "Susan B. Anthony đã làm gì?"

source: "What did the Declaration of Independence do?"
vi: "Tuyên ngôn Độc lập đã làm gì?"

source: "What did the Emancipation Proclamation do?"
vi: "Tuyên ngôn Giải phóng (Emancipation Proclamation) đã làm gì?"

source: "What do we call the first ten amendments to the Constitution?"
vi: "Chúng ta gọi mười tu chính án đầu tiên của Hiến pháp là gì?"

source: "What do we show loyalty to when we say the Pledge of Allegiance?"
vi: "Khi đọc Lời Tuyên Thệ Trung Thành (Pledge of Allegiance), chúng ta thể hiện lòng trung thành với điều gì?"

source: "What does the Constitution do?"
vi: "Hiến pháp có chức năng gì?"

source: "What does the judicial branch do?"
vi: "Nhánh tư pháp làm gì?"

source: "What does the President Cabinet do?"
vi: "Nội các của Tổng thống làm gì?"

source: "What group of people was taken to America and sold as slaves?"
vi: "Nhóm người nào bị đưa đến Mỹ và bị bán làm nô lệ?"

source: "What happened at the Constitutional Convention?"
vi: "Điều gì đã xảy ra tại Đại hội Lập hiến?"

source: "What is an amendment?"
vi: "Tu chính án là gì?"

source: "What is freedom of religion?"
vi: "Tự do tôn giáo là gì?"

source: "What is one promise you make when you become a United States citizen?"
vi: "Một lời hứa khi trở thành công dân Hoa Kỳ là gì?"

source: "What is one reason colonists came to America?"
vi: "Một lý do khiến những người định cư đến Mỹ là gì?"

source: "What is one responsibility that is only for United States citizens?"
vi: "Một trách nhiệm chỉ dành cho công dân Hoa Kỳ là gì?"

source: "What is one right or freedom from the First Amendment?"
vi: "Một quyền hoặc tự do nào từ Tu chính án Thứ Nhất?"

source: "What is one thing Benjamin Franklin is famous for?"
vi: "Benjamin Franklin nổi tiếng về điều gì?"

source: "What is the capital of the United States?"
vi: "Thủ đô của Hoa Kỳ là gì?"

source: "What is the capital of your state?"
vi: "Thủ phủ của tiểu bang bạn là gì?"

source: "What is the economic system in the United States?"
vi: "Hệ thống kinh tế của Hoa Kỳ là gì?"

source: "What is the highest court in the United States?"
vi: "Tòa án cao nhất ở Hoa Kỳ là gì?"

source: "What is the name of the national anthem?"
vi: "Tên quốc ca là gì?"

source: "What is the name of the President of the United States now?"
vi: "Tên của Tổng thống Hoa Kỳ hiện nay là gì?"

source: "What is the name of the Speaker of the House of Representatives now?"
vi: "Tên của Chủ tịch Hạ viện hiện nay là gì?"

source: "What is the name of the Vice President of the United States now?"
vi: "Tên của Phó Tổng thống Hoa Kỳ hiện nay là gì?"

source: "What is the political party of the President now?"
vi: "Tổng thống hiện nay thuộc đảng chính trị nào?"

source: "What is the rule of law?"
vi: "Pháp quyền (rule of law) là gì?"

source: What is the supreme law of the land?
vi: Luật tối cao của đất nước là gì?

source: "What major event happened on September 11, 2001, in the United States?"
vi: "Sự kiện trọng đại nào xảy ra ngày 11 tháng 9 năm 2001 tại Hoa Kỳ?"

source: "What movement tried to end racial discrimination?"
vi: "Phong trào nào cố gắng chấm dứt phân biệt chủng tộc?"

source: "What ocean is on the East Coast of the United States?"
vi: "Đại dương nào ở Bờ Đông Hoa Kỳ?"

source: "What ocean is on the West Coast of the United States?"
vi: "Đại dương nào ở Bờ Tây Hoa Kỳ?"

source: "What stops one branch of government from becoming too powerful?"
vi: "Điều gì ngăn một nhánh chính phủ trở nên quá quyền lực?"

source: "What territory did the United States buy from France in 1803?"
vi: "Hoa Kỳ đã mua lãnh thổ nào từ Pháp năm 1803?"

source: "What was one important thing that Abraham Lincoln did?"
vi: "Một điều quan trọng mà Abraham Lincoln đã làm là gì?"

source: "When do we celebrate Independence Day?"
vi: "Chúng ta kỷ niệm Ngày Độc lập vào ngày nào?"

source: "When is the last day you can send in federal income tax forms?"
vi: "Ngày cuối cùng bạn có thể nộp mẫu thuế thu nhập liên bang là ngày nào?"

source: "When must all men register for the Selective Service?"
vi: "Khi nào tất cả nam giới phải đăng ký Dịch vụ Quân dịch (Selective Service)?"

source: "When was the Constitution written?"
vi: "Hiến pháp được viết vào năm nào?"

source: "When was the Declaration of Independence adopted?"
vi: "Tuyên ngôn Độc lập được thông qua khi nào?"

source: "Where is the Statue of Liberty?"
vi: "Tượng Nữ thần Tự do ở đâu?"

source: "Who did the United States fight in World War II?"
vi: "Hoa Kỳ đã chiến đấu với ai trong Thế chiến II?"

source: "Who does a U.S. Senator represent?"
vi: "Một Thượng nghị sĩ Hoa Kỳ đại diện cho ai?"

source: "Who is in charge of the executive branch?"
vi: "Ai đứng đầu nhánh hành pháp?"

source: "Who is one of your state U.S. Senators now?"
vi: "Hiện nay, ai là một trong những Thượng nghị sĩ Hoa Kỳ của tiểu bang bạn?"

source: "Who is the Chief Justice of the United States now?"
vi: "Ai là Chánh án Hoa Kỳ hiện nay?"

source: "Who is the Commander in Chief of the military?"
vi: "Ai là Tổng tư lệnh các lực lượng vũ trang?"

source: "Who is the Father of Our Country?"
vi: "Ai được gọi là 'Cha của đất nước'?"

source: "Who is the Governor of your state now?"
vi: "Ai là Thống đốc tiểu bang của bạn hiện nay?"

source: "Who lived in America before the Europeans arrived?"
vi: "Ai sống ở Mỹ trước khi người châu Âu đến?"

source: "Who makes federal laws?"
vi: "Ai làm luật liên bang?"

source: "Who signs bills to become laws?"
vi: "Ai ký các dự luật để trở thành luật?"

source: "Who vetoes bills?"
vi: "Ai phủ quyết các dự luật?"

source: "Who was President during the Great Depression and World War II?"
vi: "Ai là Tổng thống trong thời kỳ Đại Khủng hoảng và Thế chiến II?"

source: "Who was President during World War I?"
vi: "Ai là Tổng thống trong Thế chiến I?"

source: "Who was the first President?"
vi: "Ai là Tổng thống đầu tiên?"

source: "Who wrote the Declaration of Independence?"
vi: "Ai viết Tuyên ngôn Độc lập?"

source: "Why did the colonists fight the British?"
vi: "Tại sao các thuộc địa chiến đấu chống lại Anh?"

source: "Why do some states have more Representatives than other states?"
vi: "Tại sao một số tiểu bang có nhiều Dân biểu hơn những tiểu bang khác?"

source: "Why does the flag have 13 stripes?"
vi: "Tại sao lá cờ có 13 sọc?"

source: "Why does the flag have 50 stars?"
vi: "Tại sao lá cờ có 50 sao?"

source: Women suffrage
vi: Phụ nữ quyền bầu cử

source: Worked for equality for all Americans
vi: Đã làm việc cho sự bình đẳng cho tất cả người Mỹ

source: World War I
vi: Thế chiến I.

source: World War II
vi: Thế chiến II

source: Write to a newspaper
vi: Viết thư cho một tờ báo

source: Writer of Poor Richard Almanac
vi: Nhà văn của Richard Almanac tội nghiệp

source: Writes federal regulations
vi: Viết các quy định liên bang

source: wrote the Constitution
vi: đã viết Hiến pháp

source: Wrote the Declaration of Independence
vi: Đã viết Tuyên bố độc lập

source: You can practice any religion, or not practice a religion.
vi: Bạn có thể thực hành bất kỳ tôn giáo, hoặc không thực hành một tôn giáo.

source: You dont have to pay (a poll tax) to vote
vi: Bạn không cần phải trả (thuế thăm dò) để bỏ phiếu

source: You must choose a religion by age 18.
vi: Bạn phải chọn một tôn giáo ở tuổi 18.
